zevero/avr_boot/avr/boards.txt
##############################################################

menu.model=Model
menu.clock=Clock
menu.SDCS=SD CS Pin
menu.BOD=BOD
menu.pinout=Pinout
menu.processor=Processor

##############################################################

avr_boot_atmega328.name=ATmega328/P

avr_boot_atmega328.upload.tool=arduino:avrdude
avr_boot_atmega328.upload.maximum_data_size=2048
avr_boot_atmega328.upload.maximum_size=28672

avr_boot_atmega328.bootloader.tool=arduino:avrdude
avr_boot_atmega328.bootloader.high_fuses=0xD8
avr_boot_atmega328.bootloader.unlock_bits=0x3F
avr_boot_atmega328.bootloader.lock_bits=0x0F

avr_boot_atmega328.build.core=arduino:arduino
avr_boot_atmega328.build.board=AVR_ATMEGA328P

# Processor Menu
avr_boot_atmega328.menu.processor.atmega328p=ATmega328P
avr_boot_atmega328.menu.processor.atmega328p.build.mcu=atmega328p

avr_boot_atmega328.menu.processor.atmega328=ATmega328
avr_boot_atmega328.menu.processor.atmega328.build.mcu=atmega328

# Model Menu
avr_boot_atmega328.menu.model.uno=Uno
avr_boot_atmega328.menu.model.uno.build.variant=arduino:standard
avr_boot_atmega328.menu.model.uno.build.board=AVR_UNO

avr_boot_atmega328.menu.model.duemilanove=Duemilanove or Diecimila
avr_boot_atmega328.menu.model.duemilanove.build.variant=arduino:standard
avr_boot_atmega328.menu.model.duemilanove.build.board=AVR_DUEMILANOVE

avr_boot_atmega328.menu.model.nano=Nano
avr_boot_atmega328.menu.model.nano.build.variant=arduino:eightanaloginputs
avr_boot_atmega328.menu.model.nano.build.board=AVR_NANO

avr_boot_atmega328.menu.model.mini=Mini
avr_boot_atmega328.menu.model.mini.build.variant=arduino:eightanaloginputs
avr_boot_atmega328.menu.model.mini.build.board=AVR_MINI

avr_boot_atmega328.menu.model.ethernet=Ethernet
avr_boot_atmega328.menu.model.ethernet.build.variant=arduino:ethernet
avr_boot_atmega328.menu.model.ethernet.build.board=AVR_ETHERNET

avr_boot_atmega328.menu.model.fio=Fio
avr_boot_atmega328.menu.model.fio.build.variant=arduino:eightanaloginputs
avr_boot_atmega328.menu.model.fio.build.board=AVR_FIO

avr_boot_atmega328.menu.model.bt=BT
avr_boot_atmega328.menu.model.bt.build.variant=arduino:eightanaloginputs
avr_boot_atmega328.menu.model.bt.build.board=AVR_BT

avr_boot_atmega328.menu.model.pro=Pro or Pro Mini
avr_boot_atmega328.menu.model.pro.build.variant=arduino:eightanaloginputs
avr_boot_atmega328.menu.model.pro.build.board=AVR_PRO

avr_boot_atmega328.menu.model.metro=Metro
avr_boot_atmega328.menu.model.metro.build.variant=arduino:standard
avr_boot_atmega328.menu.model.metro.build.board=AVR_METRO

avr_boot_atmega328.menu.model.protrinket5=Pro Trinket 5V/16MHz (USB)
avr_boot_atmega328.menu.model.protrinket5.build.variant=arduino:eightanaloginputs
avr_boot_atmega328.menu.model.protrinket5.build.board=AVR_PROTRINKET5

avr_boot_atmega328.menu.model.protrinket3=Pro-Trinket 3.3V USB Programming Configuration
avr_boot_atmega328.menu.model.protrinket3.build.variant=arduino:eightanaloginputs
avr_boot_atmega328.menu.model.protrinket3.build.board=AVR_PROTRINKET3

avr_boot_atmega328.menu.model.protrinket5ftdi=Pro-Trinket 5V Serial/FTDI Programming Configuration
avr_boot_atmega328.menu.model.protrinket5ftdi.build.variant=arduino:eightanaloginputs
avr_boot_atmega328.menu.model.protrinket5ftdi.build.board=AVR_PROTRINKET5FTDI

avr_boot_atmega328.menu.model.protrinket3ftdi=Pro-Trinket 3.3V Serial/FTDI Programming Configuration
avr_boot_atmega328.menu.model.protrinket3ftdi.build.variant=arduino:eightanaloginputs
avr_boot_atmega328.menu.model.protrinket3ftdi.build.board=AVR_PROTRINKET3FTDI

avr_boot_atmega328.menu.model.redboard=RedBoard
avr_boot_atmega328.menu.model.redboard.build.variant=arduino:standard
avr_boot_atmega328.menu.model.redboard.build.board=REDBOARD

avr_boot_atmega328.menu.model.digitalsandbox=Digital Sandbox
avr_boot_atmega328.menu.model.digitalsandbox.build.variant=arduino:standard
avr_boot_atmega328.menu.model.digitalsandbox.build.board=AVR_DIGITAL_SANDBOX

avr_boot_atmega328.menu.model.RedBot=RedBot
avr_boot_atmega328.menu.model.RedBot.build.variant=arduino:standard
avr_boot_atmega328.menu.model.RedBot.build.board=REDBOT

avr_boot_atmega328.menu.model.other6=Other(6 analog inputs)
avr_boot_atmega328.menu.model.other6.build.variant=arduino:standard
avr_boot_atmega328.menu.model.other6.build.board=AVR_OTHER_6_ANALOG

avr_boot_atmega328.menu.model.other8=Other(8 analog inputs)
avr_boot_atmega328.menu.model.other8.build.variant=arduino:eightanaloginputs
avr_boot_atmega328.menu.model.other8.build.board=AVR_PRO

# Clock Menu
avr_boot_atmega328.menu.clock.16mhz_low_power=16MHz External Low Power
avr_boot_atmega328.menu.clock.16mhz_low_power.bootloader.low_fuses=0xFF
avr_boot_atmega328.menu.clock.16mhz_low_power.build.f_cpu=16000000L

avr_boot_atmega328.menu.clock.16mhz_full_swing=16MHz External Full Swing
avr_boot_atmega328.menu.clock.16mhz_full_swing.bootloader.low_fuses=0xF7
avr_boot_atmega328.menu.clock.16mhz_full_swing.build.f_cpu=16000000L

avr_boot_atmega328.menu.clock.20mhz=20MHz External
avr_boot_atmega328.menu.clock.20mhz.bootloader.low_fuses=0xF7
avr_boot_atmega328.menu.clock.20mhz.build.f_cpu=20000000L

avr_boot_atmega328.menu.clock.8mhz_low_power=8MHz External Low Power
avr_boot_atmega328.menu.clock.8mhz_low_power.bootloader.low_fuses=0xFF
avr_boot_atmega328.menu.clock.8mhz_low_power.build.f_cpu=8000000L

avr_boot_atmega328.menu.clock.8mhz_full_swing=8MHz External Full Swing
avr_boot_atmega328.menu.clock.8mhz_full_swing.bootloader.low_fuses=0xF7
avr_boot_atmega328.menu.clock.8mhz_full_swing.build.f_cpu=8000000L

avr_boot_atmega328.menu.clock.8mhz_internal=8MHz Internal
avr_boot_atmega328.menu.clock.8mhz_internal.bootloader.low_fuses=0xE2
avr_boot_atmega328.menu.clock.8mhz_internal.build.f_cpu=8000000L

#SD CS Pin Menu
avr_boot_atmega328.menu.SDCS.4=4
avr_boot_atmega328.menu.SDCS.4.cs_pin=4

avr_boot_atmega328.menu.SDCS.8=8
avr_boot_atmega328.menu.SDCS.8.cs_pin=8

avr_boot_atmega328.menu.SDCS.10=10
avr_boot_atmega328.menu.SDCS.10.cs_pin=10

# BOD Menu
avr_boot_atmega328.menu.BOD.2_7=2.7V
avr_boot_atmega328.menu.BOD.2_7.bootloader.extended_fuses=0x05

avr_boot_atmega328.menu.BOD.4_3=4.3V
avr_boot_atmega328.menu.BOD.4_3.bootloader.extended_fuses=0xFC

avr_boot_atmega328.menu.BOD.1_8=1.8V
avr_boot_atmega328.menu.BOD.1_8.bootloader.extended_fuses=0xFE

avr_boot_atmega328.menu.BOD.off=Off
avr_boot_atmega328.menu.BOD.off.bootloader.extended_fuses=0xFF

avr_boot_atmega328.bootloader.file={build.mcu}_cs{cs_pin}_{build.f_cpu}.hex

